<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Prompt:wght@500&display=swap" rel="stylesheet">
<style>
    body{
        font-family: 'Prompt', sans-serif;
    }
</style>
</head>
<body>
    <?php
        echo "<b>1. ตัวดำเนินการ</b><br>";
        $x =20; $y = 3;
        echo "ผลลัพธ์ของ $x + $y เท่ากับ ".($x + $y)."<br>";
        echo "ผลลัพธ์ของ $x - $y เท่ากับ ".($x - $y)."<br>";
        echo "ผลลัพธ์ของ $x * $y เท่ากับ ".($x * $y)."<br>";
        echo "ผลลัพธ์ของ $x / $y เท่ากับ ".($x / $y)."<br>";
        echo "ผลลัพธ์ของ $x % $y เท่ากับ ".($x % $y)."<br>";
        echo "<br>";
        echo "<br>";


        echo "<b>2. ตัวดำเนินการเพิ่มค่า ลดค่า</b><br>";
        $x =10; $a = 10;
        $b=++$a;
        $z=$x++;
        echo "ค่าของ x และ a (ก่อนการประมวลผล) x=10, a=10 <br>";
        echo "ค่าของ z(จากสูตร z=x++ นำค่า x ไปเก็บใน z จะได้ค่าเดิมของ x)= $z ,<br>";
        echo "ค่าของ b(จากสูตร b=++a เพิ่มค่าให้ a ก่อนแล้วนำไปเก็บใน b)= $b ,<br>";
        echo "ค่าของ x และ a (หลังการประมวลผล) x=$x, a=$a <br>";
        echo "<br>";
        echo "<br>";


        echo "<b>3. ตัวดำเนินการ</b><br>";
    ?>
    <?php
        echo "ถ้าเงินเดือนน้อยกว่า 10,000 บาท ให้ได้รับโบนัส 80% ของเงินเดือน<br>";
        echo "ถ้าเงินเดือน  10,000 - 50,000 บาท ให้ได้รับโบนัส 50% ของเงินเดือน<br>";
        echo "ถ้าเงินเดือนมากกว่า 50,000 บาทขึ้นไป ให้ได้รับโบนัส 30% ของเงินเดือน<br><br>";
        $s = 50000;
        if ($s<10000){
            echo "เงินเดือน = $s บาท<br>";
            echo "------------------------------------<br>";
            echo "ได้โบนัส = ".($s* 0.8)." บาท<br>";
            echo "รายรับสุทธิ = ".($s+($s* 0.8))." บาท<br>";
            echo "คิดภาษี 7% จากรายรับสุทธิ = ".($s+($s* 0.8))*0.07." บาท<br>";
            echo "รายรับหลังหักภาษี = ".(($s+($s* 0.8))-($s+($s* 0.8))*0.07)." บาท<br>";
            echo "------------------------------------<br>";
        }else if ($s<=50000){
            echo "เงินเดือน = $s บาท<br>";
            echo "------------------------------------<br>";
            echo "ได้โบนัส = ".($s* 0.5)." บาท<br>";
            echo "รายรับสุทธิ = ".($s+($s* 0.5))." บาท<br>";
            echo "คิดภาษี 7% จากรายรับสุทธิ = ".($s+($s* 0.5))*0.07." บาท<br>";
            echo "รายรับหลังหักภาษี = ".(($s+($s* 0.5))-($s+($s* 0.5))*0.07)." บาท<br>";
            echo "------------------------------------<br>";
        }else if ($s>50000){
            echo "เงินเดือน = $s บาท<br>";
            echo "------------------------------------<br>";
            echo "ได้โบนัส = ".($s* 0.3)." บาท<br>";
            echo "รายรับสุทธิ = ".($s+($s* 0.3))." บาท<br>";
            echo "คิดภาษี 7% จากรายรับสุทธิ = ".($s+($s* 0.3))*0.07." บาท<br>";
            echo "รายรับหลังหักภาษี = ".(($s+($s* 0.3))-($s+($s* 0.3))*0.07)." บาท<br>";
            echo "------------------------------------<br>";
        }
    ?>
    <?php
        $name = ["สมชาย", "สมหญิง", "สมปอง", "สมหมาย", "สมน้ำหน้า"];
        $age = [15, 11, 18, 17, 13];
        echo $name[0]." = ".$age[0]." ปี" . "<br>";
        echo $name[1]." = ".$age[1]." ปี" . "<br>";
        echo $name[2]." = ".$age[2]." ปี" . "<br>";
        echo $name[3]." = ".$age[3]." ปี" . "<br>";
        echo $name[4]." = ".$age[4]." ปี" . "<br>";
    ?>

    
</body>
</html>